INSERT INTO author(author_id, "name") VALUES
	(DEFAULT, 'Владимир Ленин'),
	(DEFAULT, 'Кир Булычёв'),
	(DEFAULT, 'Лев Толстой'),
	(DEFAULT, 'Джон Рональд Руэл Толкин'),
	(DEFAULT, 'Борис Васильев'),
	(DEFAULT, 'Крис Метцен'),
	(DEFAULT, 'Роберт Брукс');
	
INSERT INTO publisher(publisher_id, "name") VALUES
	(DEFAULT, 'АСТ'),
	(DEFAULT, 'Эксмо'),
	(DEFAULT, 'Росмэн'),
	(DEFAULT, 'URSS'),
	(DEFAULT, 'Азбука'),
	(DEFAULT, 'Искатель'),
	(DEFAULT, 'Neoclassic');
	
INSERT INTO product(product_id, isbn, "name", authors, publisher_id, year_of_publishing) VALUES
	(DEFAULT, '9785382019963', 'Шаг вперёд, два шага назад', '{1}', 4, 2020),
	(DEFAULT, '9785353074175', 'Девочка с земли. Путешествие Алисы', '{2}', 3, NULL),
	(DEFAULT, '9785042608941', 'Путешествие Алисы', '{2}', 2, 2022),
	(DEFAULT, '9785172472368', 'Приключения Алисы Селезнёвой', '{2}', 1, 2023),
	(DEFAULT, '9785389071230', 'Война и мир', '{3}', 5, 2022),
	(DEFAULT, '9785605424441', 'Детство', '{3}', 6, 2023),
	(DEFAULT, '9785170937691', 'Властелин колец. Хранители Кольца', '{4}', 1, 2023),
	(DEFAULT, '9785171061234', 'Хоббит', '{4}', 7, 2022),
	(DEFAULT, '9785041780319', 'Завтра была война', '{5}', 2, 2023),
	(DEFAULT, '9785170936298', 'Варкрафт. Хроники', '{6, 7}', 1, 2016);
	
INSERT INTO reader(reader_id, "name", address, phone) VALUES
	(DEFAULT, 'Алмазова Инесса Михайловна', 'Самарская обл., с. Солнечная Поляна, СНТ "Газовик", уч. 13', 88005553535),
	(DEFAULT, 'Михайлов Роман Бальтазарович', 'Самарская обл., пос. Зольное, ул. Подгорная, д. 7А', 89270000000),
	(DEFAULT, 'Ивлев Никита Александрович', 'Самарская обл., г. Жигулёвск, ул. Морквашинская, д. 29, кв. 3', 89272638966),
	(DEFAULT, 'Васильев Валерий А', 'г. Москва, Ломоносовский пр-кт, д. 27к11', 84956610394),
	(DEFAULT, 'Калигин Владислав Александрович', 'Самарская обл., г. Самара, ул. Нагорная, д. 78к1, кв. 6', 88482957000),
	(DEFAULT, 'Иновенков Игорь Николаевич', 'Самарская обл., с. Шелехметь, ул. Дачная, д. 28', 89284567890);
	
INSERT INTO book(book_id, product_id, receiving_date) VALUES
	(DEFAULT, 1, '26.04.2019'),
	(DEFAULT, 2, '16.07.2021'),
	(DEFAULT, 2, '04.06.2019'),
	(DEFAULT, 2, '03.03.2022'),
	(DEFAULT, 2, '19.12.1972'),
	(DEFAULT, 2, '02.03.2004'),
	(DEFAULT, 2, '24.03.1983'),
	(DEFAULT, 2, '02.02.2010'),
	(DEFAULT, 3, '18.10.2003'),
	(DEFAULT, 3, '19.11.2003'),
	(DEFAULT, 4, '11.09.2003'),
	(DEFAULT, 5, '08.08.2008'),
	(DEFAULT, 5, '05.05.2003'),
	(DEFAULT, 5, '12.05.2003'),
	(DEFAULT, 5, '11.12.2003'),
	(DEFAULT, 6, '29.03.2003'),
	(DEFAULT, 7, '20.12.2013'),
	(DEFAULT, 8, '30.08.2016'),
	(DEFAULT, 9, '14.08.2018'),
	(DEFAULT, 10, '04.07.2021'),
	(DEFAULT, 10, '08.10.2022');
	
INSERT INTO issue(issue_id, book_id, reader_id, issued, returned, deadline) VALUES
	(DEFAULT, 1, 1, '01.01.2023', '01.02.2023', NULL),
	(DEFAULT, 1, 2, '02.02.2023', NULL, '02.02.2025'),
	(DEFAULT, 2, 2, '19.02.2024', NULL, NULL),
	(DEFAULT, 3, 3, '18.01.2024', '27.01.2024', '01.02.2024'),
	(DEFAULT, 4, 4, '05.09.2023', NULL, '05.09.2024'),
	(DEFAULT, 10, 5, '08.10.2023', '08.11.2023', NULL),
	(DEFAULT, 11, 6, '21.04.2023', NULL, NULL),
	(DEFAULT, 12, 1, '10.02.2023', '14.03.2023', '10.02.2024'),
	(DEFAULT, 12, 1, '05.05.2023', '14.06.2023', '05.05.2024'),
	(DEFAULT, 12, 1, '17.08.2023', '17.09.2023', '17.08.2024'),
	(DEFAULT, 17, 1, '25.03.2023', NULL, '25.03.2024'),
	(DEFAULT, 19, 1, '27.11.2023', '28.12.2023', '01.01.2024'),
	(DEFAULT, 20, 1, '02.06.2023', '03.06.2023', NULL);